Documents/ДвижениеМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДвижениеМорозилок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМорозилок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Морозилки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Морозилка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Морозилки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипМестаМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипМестаМорозилок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НашСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидОперацииМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидОперацииМорозилок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Морозилки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Морозилки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ДвижениеМорозилок/Forms/ФормаДокумента/Ext/Form/Module.bsl
// === Помощники ===

&НаСервере
Функция ИмяФормыВыбораПоТипу(ТипМеста) Экспорт
	Если ТипМеста = Неопределено Тогда 
		Возврат ""; 
	КонецЕсли;
	
	Если ТипМеста = Перечисления.ТипМестаМорозилок.НашСклад Тогда
		Возврат "Справочник.Склады.ФормаВыбора";
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Контрагент Тогда
		// если у тебя Партнеры — замени на Справочник.Партнеры.ФормаВыбора
		Возврат "Справочник.Партнеры.ФормаВыбора";
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Поставщик Тогда
		Возврат "Справочник.Партнеры.ФормаВыбора";
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Ремонт Тогда
		// ремонт как отдельный склад/зона
		Возврат "Справочник.Склады.ФормаВыбора";
	КонецЕсли;
	
	Возврат "";
КонецФункции

&НаСервере
Функция ИмяФормыВыбораПоТипуМеста(ТипМеста) Экспорт
	Если ТипМеста = Неопределено Тогда Возврат ""; КонецЕсли;
	
	Если ТипМеста = Перечисления.ТипМестаМорозилок.НашСклад Тогда
		Возврат "Справочник.Склады.ФормаВыбора";
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Контрагент Тогда
		Возврат "Справочник.Партнеры.ФормаВыбора"; // В некоторых конфах: Справочник.Партнеры.ФормаВыбора
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Поставщик Тогда
		Возврат "Справочник.Партнеры.ФормаВыбора"; // можно добавить отбор "ЭтоПоставщик"
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Ремонт Тогда
		Возврат "Справочник.Склады.ФормаВыбора"; // ремонт как отдельный склад/зона
	КонецЕсли;
	
	Возврат "";
КонецФункции

&НаСервере
Функция ПроверитьСоответствиеТипуМеста(Значение, ТипМеста) Экспорт
	Если Значение = Неопределено Тогда Возврат Истина; КонецЕсли;
	ТипЗнач = ТипЗнч(Значение);
	
	Если ТипМеста = Перечисления.ТипМестаМорозилок.НашСклад Тогда
		Возврат ТипЗнач = Тип("СправочникСсылка.Склады");
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Контрагент 
		ИЛИ ТипМеста = Перечисления.ТипМестаМорозилок.Поставщик Тогда
		Возврат ТипЗнач = Тип("СправочникСсылка.Партнеры"); // или СправочникСсылка.Партнеры
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Ремонт Тогда
		Возврат ТипЗнач = Тип("СправочникСсылка.Склады");
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Функция СоответствуетТипу(Значение, ТипМеста) Экспорт
	Если Значение = Неопределено Тогда 
		Возврат Истина; 
	КонецЕсли;
	
	Т = ТипЗнч(Значение);
	
	Если ТипМеста = Перечисления.ТипМестаМорозилок.НашСклад 
		ИЛИ ТипМеста = Перечисления.ТипМестаМорозилок.Ремонт Тогда
		Возврат Т = Тип("СправочникСсылка.Склады");
		
	ИначеЕсли ТипМеста = Перечисления.ТипМестаМорозилок.Контрагент
		ИЛИ ТипМеста = Перечисления.ТипМестаМорозилок.Поставщик Тогда
		Возврат Т = Тип("СправочникСсылка.Партнеры"); // или Партнеры
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// === События формы ===

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеБлокамиОткудаКуда(ЗначениеЗаполнено(Объект.ВидОперации));
	ПриОткрНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрНаСервере()
	Для каждого Строка из Объект.Морозилки Цикл
		Морозилка = Строка.Морозилка;
		
		Строка.МорозилкаДатаВыпуска = Морозилка.ДатаВыпуска;
		Строка.МорозилкаЗаводскойНомер = Морозилка.ЗаводскойНомер;
		Строка.МорозилкаЗалоговаяСтоимость = Морозилка.ЗалоговаяСтоимость;
		Строка.МорозилкаИнвентарныйНомер = Морозилка.ИнвентарныйНомер;
		Строка.МорозилкаТипМК = Морозилка.ТипМК;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьПресетыОткудаКуда();
	УправлениеБлокамиОткудаКуда(Истина);
	Если Объект.Морозилки.Количество() > 0 Тогда
		Если Вопрос("При смене вида операции табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
			Объект.Морозилки.Очистить();
		Иначе
			Элемент.Значение = Элемент.ЗначениеСтарое;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПресетыОткудаКуда()
	
	
	Объект.ОткудаТип = Неопределено; Объект.ОткудаОбъект = Неопределено;
	Объект.КудаТип   = Неопределено; Объект.КудаОбъект   = Неопределено;
		
	Массив = Новый Массив(); 
	Массив.Добавить(Тип("СправочникСсылка.Партнеры")); 
	ОписаниеПартнеры = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив(); 
	Массив.Добавить(Тип("СправочникСсылка.Склады")); 
	ОписаниеСклады = Новый ОписаниеТипов(Массив);
	
	
	Если Объект.ВидОперации = Перечисления.ВидОперацииМорозилок.ПриходОтПоставщика Тогда
		Элементы.ОткудаОбъект.ОграничениеТипа = ОписаниеПартнеры;
		ОткудаОбъект = ОписаниеПартнеры.ПривестиЗначение(ОткудаОбъект);
		
		Элементы.КудаОбъект.ОграничениеТипа = ОписаниеСклады;
		КудаОбъект = ОписаниеСклады.ПривестиЗначение(КудаОбъект);
		
		Объект.ОткудаТип = Перечисления.ТипМестаМорозилок.Поставщик;
		Объект.ОткудаОбъект = Справочники.Партнеры.НайтиПоКоду("00-00000352");
		Объект.КудаТип   = Перечисления.ТипМестаМорозилок.НашСклад;
		Объект.КудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидОперацииМорозилок.ПередачаКлиенту Тогда
		Элементы.ОткудаОбъект.ОграничениеТипа = ОписаниеСклады;
		ОткудаОбъект = ОписаниеСклады.ПривестиЗначение(ОткудаОбъект);
		
		Элементы.КудаОбъект.ОграничениеТипа = ОписаниеПартнеры;
		КудаОбъект = ОписаниеПартнеры.ПривестиЗначение(КудаОбъект);
		
		Объект.ОткудаТип = Перечисления.ТипМестаМорозилок.НашСклад;
		Объект.ОткудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
		Объект.КудаТип   = Перечисления.ТипМестаМорозилок.Контрагент;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидОперацииМорозилок.ВозвратОтКлиента Тогда
		Элементы.ОткудаОбъект.ОграничениеТипа = ОписаниеПартнеры;
		ОткудаОбъект = ОписаниеПартнеры.ПривестиЗначение(ОткудаОбъект);
		
		Элементы.КудаОбъект.ОграничениеТипа = ОписаниеСклады;
		КудаОбъект = ОписаниеСклады.ПривестиЗначение(КудаОбъект);
		
		Объект.ОткудаТип = Перечисления.ТипМестаМорозилок.Контрагент;
		Объект.КудаТип   = Перечисления.ТипМестаМорозилок.НашСклад;
		Объект.КудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидОперацииМорозилок.ВозвратПоставщику Тогда
		Элементы.ОткудаОбъект.ОграничениеТипа = ОписаниеСклады;
		ОткудаОбъект = ОписаниеСклады.ПривестиЗначение(ОткудаОбъект);
		
		Элементы.КудаОбъект.ОграничениеТипа = ОписаниеПартнеры;
		КудаОбъект = ОписаниеПартнеры.ПривестиЗначение(КудаОбъект);
		
		Объект.ОткудаТип = Перечисления.ТипМестаМорозилок.НашСклад;
		Объект.ОткудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
		Объект.КудаТип   = Перечисления.ТипМестаМорозилок.Поставщик;
		Объект.КудаОбъект = Справочники.Партнеры.НайтиПоКоду("00-00000352");
	КонецЕсли;
	
	//ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОткудаТипПриИзменении(Элемент)
	Объект.ОткудаОбъект = Неопределено; // очистка при смене типа
КонецПроцедуры

&НаКлиенте
Процедура КудаТипПриИзменении(Элемент)
	Объект.КудаОбъект = Неопределено; // очистка при смене типа
КонецПроцедуры

// --- выбор значений по типу места ---

&НаКлиенте
Процедура ОткудаОбъектНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяФормы = ИмяФормыВыбораПоТипуМеста(Объект.ОткудаТип);
	Если ПустаяСтрока(ИмяФормы) Тогда
		Предупреждение("Сначала выберите «Откуда (тип)».");
		Возврат;
	КонецЕсли;
	ОткрытьФорму(ИмяФормы, Неопределено, ЭтаФорма, "ОткудаОбъектВыбран");
КонецПроцедуры

&НаКлиенте
Процедура КудаОбъектНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяФормы = ИмяФормыВыбораПоТипуМеста(Объект.КудаТип);
	Если ПустаяСтрока(ИмяФормы) Тогда
		Предупреждение("Сначала выберите «Куда (тип)».");
		Возврат;
	КонецЕсли;
	ОткрытьФорму(ИмяФормы, Неопределено, ЭтаФорма, "КудаОбъектВыбран");
КонецПроцедуры

&НаКлиенте
Процедура ОткудаОбъектВыбран(ВыбранноеЗначение, Параметры)
	Если НЕ ПроверитьСоответствиеТипуМеста(ВыбранноеЗначение, Объект.ОткудаТип) Тогда
		Предупреждение("Выбранный объект не соответствует типу «Откуда».");
		Возврат;
	КонецЕсли;
	Объект.ОткудаОбъект = ВыбранноеЗначение;
	//ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура КудаОбъектВыбран(ВыбранноеЗначение, Параметры)
	Если НЕ ПроверитьСоответствиеТипуМеста(ВыбранноеЗначение, Объект.КудаТип) Тогда
		Предупреждение("Выбранный объект не соответствует типу «Куда».");
		Возврат;
	КонецЕсли;
	Объект.КудаОбъект = ВыбранноеЗначение;
	//ОбновитьИнтерфейс();
КонецПроцедуры

// --- валидация ручного ввода/перетаскивания ---

&НаКлиенте
Процедура ОткудаОбъектПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ОткудаОбъект) 
		И НЕ ПроверитьСоответствиеТипуМеста(Объект.ОткудаОбъект, Объект.ОткудаТип) Тогда
		Сообщить("Поле «Откуда (объект)» не соответствует выбранному типу. Очищаю.");
		Объект.ОткудаОбъект = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КудаОбъектПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.КудаОбъект) 
		И НЕ ПроверитьСоответствиеТипуМеста(Объект.КудаОбъект, Объект.КудаТип) Тогда
		Сообщить("Поле «Куда (объект)» не соответствует выбранному типу. Очищаю.");
		Объект.КудаОбъект = Неопределено;
	КонецЕсли;
КонецПроцедуры

// --- визуализация блоков ---

&НаКлиенте
Процедура УправлениеБлокамиОткудаКуда(Видимость)
	Элементы.ОткудаТип.Видимость   = Видимость;
	Элементы.ОткудаОбъект.Видимость= Видимость;
	Элементы.КудаТип.Видимость     = Видимость;
	Элементы.КудаОбъект.Видимость  = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАкта(Команда)
	ТабДокМаршрут = СформироватьМакетАкта(); // твоя функция
	ТабДокМаршрут.Показать("Акт");
КонецПроцедуры

&НаСервере
Функция СформироватьМакетАкта()
	
	Макет = Документы.ДвижениеМорозилок.ПолучитьМакет("АктПриемаПередачи");
	ТабДок = Новый ТабличныйДокумент;
	
	// ---- ШАПКА ----
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Номер = Объект.Номер;
	ОблШапка.Параметры.Дата  = Формат(Объект.Дата, "ДЛФ='dd.MM.yyyy'");
	ОблШапка.Параметры.НаименованиеПокупателя = Строка(Объект.КудаОбъект);
	ТабДок.Вывести(ОблШапка);
	
	// ---- СТРОКИ ТАБЛИЦЫ ----
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	ОблСтрока = Макет.ПолучитьОбласть("Таблица");
	НомерСтроки = 0;
	
	Для Каждого Стр Из Объект.Морозилки Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Морозилка) Тогда
			Продолжить;
		КонецЕсли;
		
		Карт = Стр.Морозилка;
		НомерСтроки = НомерСтроки + 1;
		
		ОблСтрока.Параметры.Номер         = НомерСтроки;
		ОблСтрока.Параметры.Модель        = Карт.ТипМК;
		ОблСтрока.Параметры.СерийныйНомер = Карт.ЗаводскойНомер;
		ОблСтрока.Параметры.ИнвентНомер   = Карт.ИнвентарныйНомер;
		ОблСтрока.Параметры.ДатаВыпуска   = Формат(Карт.ДатаВыпуска, "ДФ=dd.MM.yyyy");
		ОблСтрока.Параметры.Стоимость     = Карт.ЗалоговаяСтоимость;
		
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	// ---- ИТОГО "ВСЕГО" ----
	Попытка
		ОблВсего = Макет.ПолучитьОбласть("ОблВсего");
		ОблВсего.Параметры.Всего = НомерСтроки;
		ТабДок.Вывести(ОблВсего);
	Исключение
		// области может не быть — игнорируем
	КонецПопытки;
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("Тело"));
	ТабДок.Вывести(Макет.ПолучитьОбласть("Остатки"));
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Процедура МорозилкиМорозилкаПриИзмененииНаСервере()
	
	Строка = Объект.Морозилки[Элементы.Морозилки.ТекущаяСтрока];
	
	ЗаполнитьДанныеСтрокиМорозилки(Строка, Строка.Морозилка);
	
КонецПроцедуры

&НаКлиенте
Процедура МорозилкиМорозилкаПриИзменении(Элемент)
	МорозилкиМорозилкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйИнвентарныйНомерПриИзменении(Элемент)
	
	ИнвентарныйНомер = СокрЛП(БыстрыйИнвентарныйНомер);
	Если ПустаяСтрока(ИнвентарныйНомер) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатДобавления = ДобавитьМорозилкуПоИнвентарномуНомеруНаСервере(ИнвентарныйНомер);
	БыстрыйИнвентарныйНомер = "";
	
	Если НЕ РезультатДобавления.Успешно Тогда
		ПоказатьПредупреждение(, РезультатДобавления.Сообщение);
		Возврат;
	КонецЕсли;
	
	Элементы.Морозилки.ТекущаяСтрока = РезультатДобавления.ИндексСтроки;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьМорозилкуПоИнвентарномуНомеруНаСервере(Знач ИнвентарныйНомер)
	
	Результат = Новый Структура("Успешно, Сообщение, ИндексСтроки", Ложь, "", Неопределено);
	Морозилка = Справочники.Морозилки.НайтиПоРеквизиту("ИнвентарныйНомер", ИнвентарныйНомер);
	
	Если НЕ ЗначениеЗаполнено(Морозилка) Тогда
		Результат.Сообщение = СтрШаблон("Морозилка с инвентарным номером ""%1"" не найдена.", ИнвентарныйНомер);
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрокаМорозилки Из Объект.Морозилки Цикл
		
		Если СтрокаМорозилки.Морозилка = Морозилка Тогда
			Результат.Сообщение = СтрШаблон("Морозилка с инвентарным номером ""%1"" уже добавлена.", ИнвентарныйНомер);
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	НоваяСтрока = Объект.Морозилки.Добавить();
	ЗаполнитьДанныеСтрокиМорозилки(НоваяСтрока, Морозилка);
	
	Результат.Успешно = Истина;
	Результат.ИндексСтроки = Объект.Морозилки.Индекс(НоваяСтрока);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеСтрокиМорозилки(Строка, Морозилка)
	
	Строка.Морозилка = Морозилка;
	Строка.МорозилкаДатаВыпуска = Морозилка.ДатаВыпуска;
	Строка.МорозилкаЗаводскойНомер = Морозилка.ЗаводскойНомер;
	Строка.МорозилкаЗалоговаяСтоимость = Морозилка.ЗалоговаяСтоимость;
	Строка.МорозилкаИнвентарныйНомер = Морозилка.ИнвентарныйНомер;
	Строка.МорозилкаТипМК = Морозилка.ТипМК;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПриОткрНаСервере();
КонецПроцедуры
